docs/presentation/src/index.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil expand-links:t f:t
#+options: inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: 使用 MoonBit 和 Tree-sitter 构建 Code Linter
#+date: 2025-03-28
#+author: 费浩祥
#+email: feihaoxiang@idea.edu.cn
#+language: zh
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 30.1 (Org mode 9.7.11)
#+cite_export:
#+LATEX_COMPILER: xelatex
#+LATEX_CLASS: ctexbeamer
#+LATEX_CLASS_OPTIONS: [bigger]
#+options: H:3
#+OPTIONS: html-postamble:nil
#+HTML_HEAD: <style>
#+HTML_HEAD: @media print {
#+HTML_HEAD:   table {
#+HTML_HEAD:     page-break-inside: avoid;
#+HTML_HEAD:   }
#+HTML_HEAD:   h2, h3, h4 {
#+HTML_HEAD:     page-break-before: always;
#+HTML_HEAD:   }
#+HTML_HEAD:   p {
#+HTML_HEAD:     page-break-inside: avoid;
#+HTML_HEAD:   }
#+HTML_HEAD: }
#+HTML_HEAD: </style>

* Tree-sitter 的介绍

#+BEGIN_QUOTE
Tree-sitter is a parser generator tool and an incremental parsing library
#+END_QUOTE

Tree-sitter 有着丰富的 parser 生态，支持的语言包括但不限于：

1. JavaScript
2. C/C++
3. Python
4. Go
5. Rust
6. ...

在编辑器中，Tree-sitter 被用来实现代码高亮、结构化编辑、符号索引等功能
（Neovim, Zed）。它也被 GitHub 用来做代码导航。在 AI coding 兴起之后，
GitHub Copilot，Cline 等 AI 代码助手也利用 Tree-sitter 来实现符号查找
和代码索引。

除此之外，类似于 semgrep 和 astgrep 的工具在 Tree-sitter 的基础上提供
了对代码进行 lint 和修复的功能。相较于传统的方案，使用 Tree-sitter 进
行 lint 更加轻量，也更容易增加对新语言的支持。

* MoonBit 的引用计数机制

** 作用域生命周期

一个对象在作用域结束的时候结束它的生命周期。

#+BEGIN_SRC moonbit
fn main {
  let bytes = { ... } // RC = 1
  let b = bytes[0]
  println(b)
  // moonbit_decref(bytes), RC = 0
}
#+END_SRC

*** 提前释放所有权

然而，一些局部对象 *实际* 的生命周期可能会短于作用域。因此，我们可以在
一个对象在该作用域内最后一次使用时进行 ~decref~ 。

#+BEGIN_SRC moonbit
fn main {
  let bytes = { ... } // RC = 1
  let b = bytes[0] // last usage
  // moonbit_decref(bytes), RC = 0
  println(b)
}
#+END_SRC

** 函数调用

MoonBit 的所有权方案是 callee owned 。这意味着对象所有权会被转移到调用
函数中，如果对象的引用计数在函数调用中归零，则由该函数负责释放内存。参
数在传入 MoonBit 函数之前会先调用一次 ~incref~ 。该参数在传入函数之后
成为函数作用域里面的局部对象，因此会在函数作用域结束的时候进行
~decref~ 。

#+BEGIN_SRC moonbit
fn f(bytes : Bytes) { // RC = 2 when passed in
  // ...
  // moonbit_decref(bytes) // RC = 1
}

fn main {
  let bytes = { ... } // RC = 1
  // moonbit_incref(bytes), RC = 2
  f(bytes)
  // Returned from f, RC = 1
  // moonbit_decref(bytes), RC = 0
}
#+END_SRC

*** One Last Move

如果一个局部对象在当前作用域内的最后一次使用是作为参数传入一个函数，那
么在调用函数前对该对象的 ~incref~ 可以和最后一次使用引入的 ~decref~ 抵
消。此时，我们可以认为该对象被 /移动/ 进入了函数作用域。

#+BEGIN_SRC moonbit
fn f(bytes : Bytes) -> Unit { // RC = 1
  // ...
  // moonbit_decref(bytes) // RC = 0
}

fn main {
  let bytes = { ... } // RC = 1
  f(bytes)
}
#+END_SRC

*** 借用

我们发现，对于那些不是最后一次使用该对象的函数调用，该对象的引用计数在
~incref~ 前和函数返回后是一致的。即，去掉任意不是最后一次使用 的函数调
用，不影响对象的生命周期。此时，我们可以认为这些函数调用 /借用/ 了该对
象，该借用具有和函数调用相同的生命周期。

#+BEGIN_SRC moonbit
fn f(bytes : Bytes) -> Unit {
  // moonbit_decref(bytes)
}

fn main {
  let bytes = { ... } // RC = 1

  // 借用, RC = 1
  // moonbit_incref(bytes), RC = 2
  f(bytes)
  // RC = 1

  // 移动
  f(bytes) // RC = 0
}
#+END_SRC

** 函数返回

函数的返回值会在返回之前调用一次 ~incref~ 。

#+BEGIN_SRC moonbit
fn f() -> Bytes {
  let local = { ... } // RC = 1
  // moonbit_incref(local), RC = 2
  return local
  // moonbit_decref(local), RC = 1
}

fn main {
  let result = f() // RC = 1
  // moonbit_decref(result), RC = 0
}
#+END_SRC

*** 返回值，移动

注意，被返回的对象的生命周期会在返回以后结束。所以，该对象会在
~incref~ 后被立马 ~decref~ 。这一对 ~incref~ 和 ~decref~ 互相抵消。此
时，我们可以认为该对象被 /移动/ 出了当前作用域。

#+BEGIN_SRC moonbit
fn f() -> Bytes {
  let local = { ... } // RC = 1
  return local // RC = 1
}

fn main {
  let result = f() // RC = 1
  // moonbit_decref(result), RC = 0
}
#+END_SRC

** 聚合数据类型

MoonBit 中，聚合数据类型的对象拥有对其成员的（共享）所有权。

#+BEGIN_SRC moonbit
struct A {
  bytes : Bytes // 拥有对 bytes 的所有权
}
#+END_SRC

因此，在将一个对象存储到另一个对象中前，该对象会被 ~incref~ 。

#+BEGIN_SRC moonbit
fn main {
  let a_bytes = { ... } // RC = 1
  let a = A::{
    // moonbit_incref(a_bytes)
    bytes: a_bytes
  }
  ...
}
#+END_SRC

*** 聚合数据类型中的借用和移动

类似的，取决于该次构造是否是作用域中对该对象的最后一次使用，我们可以分
别认为该对象被 /借用/ 进入了这个对象，或者被 /移动/ 进入了这个对象。需
要注意的是，不同于函数调用的借用，此处的借用拥有和构造出来的对象相同的
生命周期。

#+BEGIN_SRC moonbit
fn main {
  let bytes = { ... } // RC = 1
  let a = A::{ bytes } // 借用，RC = 2
  let b = A::{ bytes } // 移动，RC = 3
  ...
}
#+END_SRC

*** 递归释放所有权

当一个对象的生命周期结束的时候，MoonBit 会对它的每个成员调用 ~decref~
，释放该对象拥有（共享）所有权。

#+BEGIN_SRC moonbit
fn main {
  let bytes = { ... } // RC = 1
  let a = A::{ bytes } // 借用，RC = 2
  let b = A::{ bytes } // 移动，RC = 2
  println(a)
  // moonbit_decref(a)
  // -> moonbit_decref(a.bytes), RC = 1
  println(b)
  // moonbit_decref(b)
  // -> moonbit_decref(b.bytes), RC = 0
}
#+END_SRC

* Tree-sitter 和一些 C 库的生命周期管理

在 C 中，内存对象的管理完全交由程序员来决定。然而，不少 C 库都有着借用、
移动、所有权等概念。

** 参数传递

不同于 MoonBit 采用的 callee owned 的所有权方案，
Tree-sitter 中采取了 caller owned 的所有权方案，即函数不参与参数的所有
权管理，但是调用者需要对函数的返回值进行管理。

#+BEGIN_SRC c
TSTree *ts_parser_parse_string(
  TSParser *self,
  const TSTree *old_tree,
  const char *string,
  uint32_t length
);
#+END_SRC

该函数解析传入的字符串，并将生成的语法树返回给调用者。调用者拥有该语法
树的所有权，需要在该语法树生命周期结束的时候调用 ~ts_tree_delete~ 来进
行显式的资源释放。

