docs/presentation/src/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2025-03-28 Fri 23:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 MoonBit 和 Tree-sitter 构建 Code Linter</title>
<meta name="author" content="费浩祥" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">使用 MoonBit 和 Tree-sitter 构建 Code Linter</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org634b0a7">1. Tree-sitter 的介绍</a></li>
<li><a href="#org480fea4">2. MoonBit 的引用计数机制</a>
<ul>
<li><a href="#org642063e">2.1. 作用域生命周期</a>
<ul>
<li><a href="#org7e76a60">2.1.1. 提前释放所有权</a></li>
</ul>
</li>
<li><a href="#org52c1f98">2.2. 函数调用</a>
<ul>
<li><a href="#orgf99490b">2.2.1. One Last Move</a></li>
<li><a href="#orga476940">2.2.2. 借用</a></li>
</ul>
</li>
<li><a href="#orgfe700e8">2.3. 函数返回</a>
<ul>
<li><a href="#org4f4554c">2.3.1. 返回值，移动</a></li>
</ul>
</li>
<li><a href="#org84bf639">2.4. 聚合数据类型</a>
<ul>
<li><a href="#org5681a94">2.4.1. 聚合数据类型中的借用和移动</a></li>
<li><a href="#orgab4ceff">2.4.2. 递归释放所有权</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4eda4d6">3. Tree-sitter 和一些 C 库的生命周期管理</a>
<ul>
<li><a href="#org15ca2e9">3.1. 参数传递</a></li>
<li><a href="#orgdeaf91b">3.2. 返回值</a></li>
<li><a href="#org5d5ddb7">3.3. 聚合数据类型</a></li>
</ul>
</li>
<li><a href="#orgb998e37">4. 在 MoonBit 中绑定 Tree-sitter</a>
<ul>
<li><a href="#org42ebc7d">4.1. 外部类型</a>
<ul>
<li><a href="#org29dad3b">4.1.1. <code>@tree_sitter.Language</code></a></li>
</ul>
</li>
<li><a href="#orga9a53a8">4.2. 抽象类型</a>
<ul>
<li><a href="#org98405f0">4.2.1. <code>Node</code> 的类型定义</a></li>
<li><a href="#org4e12123">4.2.2. <code>Node</code> 类型的值的构造</a></li>
<li><a href="#orga7d46d1">4.2.3. <code>Node</code> 类型的值的析构</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3f2b453">5. 使用 MoonBit 的 Tree-sitter 绑定</a>
<ul>
<li><a href="#org8231665">5.1. <code>tonyfettes/tree_sitter/sexp</code></a></li>
<li><a href="#orga332b08">5.2. 代码检查（Lint）</a>
<ul>
<li><a href="#org2d5db67">5.2.1. 使用 <code>Node</code> API 遍历语法树</a></li>
<li><a href="#org16f5360">5.2.2. 使用 Query</a></li>
</ul>
</li>
<li><a href="#orga269307">5.3. 代码重构（Refactor）</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org634b0a7" class="outline-2">
<h2 id="org634b0a7"><span class="section-number-2">1.</span> Tree-sitter 的介绍</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Tree-sitter is a parser generator tool and an incremental parsing library
</p>
</blockquote>

<p>
Tree-sitter 有着丰富的 parser 生态，支持的语言包括但不限于：
</p>

<ol class="org-ol">
<li>JavaScript</li>
<li>C/C++</li>
<li>Python</li>
<li>Go</li>
<li>Rust</li>
<li>&#x2026;</li>
</ol>

<p>
在编辑器中，Tree-sitter 被用来实现代码高亮、结构化编辑、符号索引等功能（Neovim, Zed）。它也被 GitHub 用来做代码导航。在 AI coding 兴起之后，
GitHub Copilot，Cline 等 AI 代码助手也利用 Tree-sitter 来实现符号查找和代码索引。
</p>

<p>
除此之外，类似于 semgrep 和 astgrep 的工具在 Tree-sitter 的基础上提供了对代码进行 lint 和修复的功能。相较于传统的方案，使用 Tree-sitter 进行 lint 更加轻量，也更容易增加对新语言的支持。
</p>
</div>
</div>
<div id="outline-container-org480fea4" class="outline-2">
<h2 id="org480fea4"><span class="section-number-2">2.</span> MoonBit 的引用计数机制</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org642063e" class="outline-3">
<h3 id="org642063e"><span class="section-number-3">2.1.</span> 作用域生命周期</h3>
<div class="outline-text-3" id="text-2-1">
<p>
一个对象在作用域结束的时候结束它的生命周期。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  let bytes = { ... } // RC = 1
  let b = bytes[0]
  println(b)
  // moonbit_decref(bytes), RC = 0
}
</pre>
</div>
</div>
<div id="outline-container-org7e76a60" class="outline-4">
<h4 id="org7e76a60"><span class="section-number-4">2.1.1.</span> 提前释放所有权</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
然而，一些局部对象 <b>实际</b> 的生命周期可能会短于作用域。因此，我们可以在一个对象在该作用域内最后一次使用时进行 <code>decref</code> 。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  let bytes = { ... } // RC = 1
  let b = bytes[0] // last usage
  // moonbit_decref(bytes), RC = 0
  println(b)
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org52c1f98" class="outline-3">
<h3 id="org52c1f98"><span class="section-number-3">2.2.</span> 函数调用</h3>
<div class="outline-text-3" id="text-2-2">
<p>
MoonBit 的所有权方案是 callee owned 。这意味着对象所有权会被转移到调用函数中，如果对象的引用计数在函数调用中归零，则由该函数负责释放内存。参数在传入 MoonBit 函数之前会先调用一次 <code>incref</code> 。该参数在传入函数之后成为函数作用域里面的局部对象，因此会在函数作用域结束的时候进行
<code>decref</code> 。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn f(bytes : Bytes) { // RC = 2 when passed in
  // ...
  // moonbit_decref(bytes) // RC = 1
}

fn main {
  let bytes = { ... } // RC = 1
  // moonbit_incref(bytes), RC = 2
  f(bytes)
  // Returned from f, RC = 1
  // moonbit_decref(bytes), RC = 0
}
</pre>
</div>
</div>
<div id="outline-container-orgf99490b" class="outline-4">
<h4 id="orgf99490b"><span class="section-number-4">2.2.1.</span> One Last Move</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
如果一个局部对象在当前作用域内的最后一次使用是作为参数传入一个函数，那么在调用函数前对该对象的 <code>incref</code> 可以和最后一次使用引入的 <code>decref</code> 抵消。此时，我们可以认为该对象被 <i>移动</i> 进入了函数作用域。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn f(bytes : Bytes) -&gt; Unit { // RC = 1
  // ...
  // moonbit_decref(bytes) // RC = 0
}

fn main {
  let bytes = { ... } // RC = 1
  f(bytes)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga476940" class="outline-4">
<h4 id="orga476940"><span class="section-number-4">2.2.2.</span> 借用</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
我们发现，对于那些不是最后一次使用该对象的函数调用，该对象的引用计数在
<code>incref</code> 前和函数返回后是一致的。即，去掉任意不是最后一次使用 的函数调用，不影响对象的生命周期。此时，我们可以认为这些函数调用 <i>借用</i> 了该对象，该借用具有和函数调用相同的生命周期。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn f(bytes : Bytes) -&gt; Unit {
  // moonbit_decref(bytes)
}

fn main {
  let bytes = { ... } // RC = 1

  // 借用, RC = 1
  // moonbit_incref(bytes), RC = 2
  f(bytes)
  // RC = 1

  // 移动
  f(bytes) // RC = 0
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfe700e8" class="outline-3">
<h3 id="orgfe700e8"><span class="section-number-3">2.3.</span> 函数返回</h3>
<div class="outline-text-3" id="text-2-3">
<p>
函数的返回值会在返回之前调用一次 <code>incref</code> 。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn f() -&gt; Bytes {
  let local = { ... } // RC = 1
  // moonbit_incref(local), RC = 2
  return local
  // moonbit_decref(local), RC = 1
}

fn main {
  let result = f() // RC = 1
  // moonbit_decref(result), RC = 0
}
</pre>
</div>
</div>
<div id="outline-container-org4f4554c" class="outline-4">
<h4 id="org4f4554c"><span class="section-number-4">2.3.1.</span> 返回值，移动</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
注意，被返回的对象的生命周期会在返回以后结束。所以，该对象会在
<code>incref</code> 后被立马 <code>decref</code> 。这一对 <code>incref</code> 和 <code>decref</code> 互相抵消。此时，我们可以认为该对象被 <i>移动</i> 出了当前作用域。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn f() -&gt; Bytes {
  let local = { ... } // RC = 1
  return local // RC = 1
}

fn main {
  let result = f() // RC = 1
  // moonbit_decref(result), RC = 0
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org84bf639" class="outline-3">
<h3 id="org84bf639"><span class="section-number-3">2.4.</span> 聚合数据类型</h3>
<div class="outline-text-3" id="text-2-4">
<p>
MoonBit 中，聚合数据类型的对象拥有对其成员的（共享）所有权。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">struct A {
  bytes : Bytes // 拥有对 bytes 的所有权
}
</pre>
</div>

<p>
因此，在将一个对象存储到另一个对象中前，该对象会被 <code>incref</code> 。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  let a_bytes = { ... } // RC = 1
  let a = A::{
    // moonbit_incref(a_bytes)
    bytes: a_bytes
  }
  ...
}
</pre>
</div>
</div>
<div id="outline-container-org5681a94" class="outline-4">
<h4 id="org5681a94"><span class="section-number-4">2.4.1.</span> 聚合数据类型中的借用和移动</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
类似的，取决于该次构造是否是作用域中对该对象的最后一次使用，我们可以分别认为该对象被 <i>借用</i> 进入了这个对象，或者被 <i>移动</i> 进入了这个对象。需要注意的是，不同于函数调用的借用，此处的借用拥有和构造出来的对象相同的生命周期。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  let bytes = { ... } // RC = 1
  let a = A::{ bytes } // 借用，RC = 2
  let b = A::{ bytes } // 移动，RC = 3
  ...
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab4ceff" class="outline-4">
<h4 id="orgab4ceff"><span class="section-number-4">2.4.2.</span> 递归释放所有权</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
当一个对象的生命周期结束的时候，MoonBit 会对它的每个成员调用 <code>decref</code>
，释放该对象拥有（共享）所有权。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  let bytes = { ... } // RC = 1
  let a = A::{ bytes } // 借用，RC = 2
  let b = A::{ bytes } // 移动，RC = 2
  println(a)
  // moonbit_decref(a)
  // -&gt; moonbit_decref(a.bytes), RC = 1
  println(b)
  // moonbit_decref(b)
  // -&gt; moonbit_decref(b.bytes), RC = 0
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org4eda4d6" class="outline-2">
<h2 id="org4eda4d6"><span class="section-number-2">3.</span> Tree-sitter 和一些 C 库的生命周期管理</h2>
<div class="outline-text-2" id="text-3">
<p>
在 C 中，内存对象的管理完全交由程序员来决定。然而，不少 C 库都有着借用、移动、所有权等概念。
</p>
</div>
<div id="outline-container-org15ca2e9" class="outline-3">
<h3 id="org15ca2e9"><span class="section-number-3">3.1.</span> 参数传递</h3>
<div class="outline-text-3" id="text-3-1">
<p>
不同于 MoonBit 采用的 callee owned 的所有权方案，
Tree-sitter 中采取了 caller owned 的所有权方案，即函数不参与参数的所有权管理，但是调用者需要对函数的返回值进行管理。
</p>

<div class="org-src-container">
<pre class="src src-c">TSTree *ts_parser_parse_string(
  TSParser *self,
  const TSTree *old_tree,
  const char *string,
  uint32_t length
);
</pre>
</div>

<p>
该函数解析传入的字符串，并将生成的语法树返回给调用者。调用者拥有该语法树的所有权，需要在该语法树生命周期结束的时候调用 <code>ts_tree_delete</code> 来进行显式的资源释放。
</p>
</div>
</div>
