docs/presentation/src/index.org
** 返回值

然而，并不是所有的 API 都会将所有权交给调用者。如果函数返回的是通过
~const~ 修饰的指针，则意味着调用者拥有被返回对象的临时借用，不拥有对象
的所有权，因此不需要处理资源释放。

例如，Tree-sitter 提供的从 ~TSNode~ 获取对应的 ~TSLanguage~ ，就是对
~TSLanguage~ 的临时借用。调用者不需要释放 ~TSLanguage~ 。

#+BEGIN_SRC c
const TSLanguage *ts_node_language(TSNode self);
#+END_SRC

** 聚合数据类型

类似的，在聚合数据类型中，带有 ~const~ 修饰的指针说明这是一个借用，而
没有被修饰的指针代表对该对象的所有权。

#+BEGIN_SRC c
typedef struct TSNode {
  uint32_t context[4];
  const void *id; // 借用
  const TSTree *tree; // 借用
} TSNode;

typedef struct TSQueryCursorState {
  void *payload; // 拥有所有权，需要负责释放
  uint32_t current_byte_offset;
} TSQueryCursorState;
#+END_SRC

* 在 MoonBit 中绑定 Tree-sitter

我们可以从上面的讨论发现，MoonBit 的内存管理和 Tree-sitter 有很大的不同：

1. MoonBit 有引用计数，Tree-sitter 没有。
2. MoonBit 的借用是共享所有权，而 tree-sitter 的借用没有所有权。
3. MoonBit 采用的是 callee owned 的所有权传递，而 Tree-sitter 采用的是
   caller owned 的所有权传递。

因此，在 MoonBit 中绑定 Tree-sitter ，需要对裸的 Tree-sitter 的 C API
进行包装，从而满足 MoonBit 引用计数系统要求。

为了方便在 MoonBit 中实现 C 的 FFI 绑定，MoonBit 提供了两种对外部数据
类型的抽象：外部类型（external type）和抽象类型（abstract type）。

** 外部类型

外部类型可以通过如下方式定义：

#+BEGIN_SRC moonbit
extern type A
#+END_SRC

外部类型不参与内存管理，任何 ~A~ 类型的对象将不参与引用计数系统。这通
常用来绑定：

1. 具有静态生命周期的对象；
2. 不由 MoonBit 分配的对象；
3. 需要手动管理的对象。

外部类型在 C 代码中表示为指针（ ~void *~ ），在 MoonBit 侧可以放在接受或
者返回指针的地方。

*** ~@tree_sitter.Language~

Tree-sitter 中，我们从各个语言拿到的 ~TSLanguage~ 对象都是静态分配的，
因此，我们可以将其绑定为外部类型，从而避免传递该对象时对其进行
~incref~ / ~decref~ 操作。

#+NAME: C 函数声明
#+BEGIN_SRC c
const TSLanguage *tree_sitter_json(void);
#+END_SRC

#+NAME: MoonBit 侧绑定
#+BEGIN_SRC moonbit
extern type Language
extern "c" fn tree_sitter_json() -> Language =
  "tree_sitter_json"
#+END_SRC

需要注意的是，虽然 Tree-sitter 提供了 ~ts_language_delete~ 函数，但是
该函数只对通过 Wasm module 加载的语言有效，所以更适用外部类型来进行绑
定。

** 抽象类型

抽象类型可以通过如下的方式进行定义：

#+BEGIN_SRC moonbit
type Node
#+END_SRC

抽象类型参与内存管理，并且能够在生命周期结束的时候调用对应的析构函数，
进行自动化的资源释放，基本上可以用来绑定任何需要资源管理的对象。抽象类
型在 C 侧表示为指针（ ~void *~ ）。然而，并不是所有指针都能够被作为该
类型的值使用。由于 MoonBit 在进行 ~incref~ / ~decref~ 的时候会读取对象
头，所以只有通过 ~moonbit_make_external_object~ 分配的对象可以作为抽象
类型的值使用。以下是 ~moonbit_make_external_object~ 函数的签名。

#+BEGIN_SRC c
void *moonbit_make_external_object(
  void (*finalize)(void *self),
  uint32_t payload_size
);
#+END_SRC

*** ~Node~ 的类型定义

在 Tree-sitter 中， ~TSNode~ 表示语法树上的一个节点。

#+BEGIN_SRC c
typedef struct TSNode {
  uint32_t context[4];
  const void *id;
  const TSTree *tree;
} TSNode;
#+END_SRC

注意到， ~TSNode~ 拥有对于该节点所在语法树（ ~TSTree~ ）的借用。在
Tree-sitter 中，借用不拥有所有权，所以我们需要确保对应的语法树的生命周
期长于该节点。因此，我们在 ~MoonBitTSNode~ 中额外添加了
~MoonBitTSTree~ 的一份指针，以确保 ~MoonBitTSNode~ 在生命周期内总是持
有 ~MoonBitTSTree~ 的一份引用，防止 ~TSNode~ 中对应的指针因为 ~TSTree~
被释放而失效。

#+BEGIN_SRC c
typedef struct MoonBitTSNode {
  TSNode node;
  MoonBitTSNode *tree;
} MoonBitTSNode;
#+END_SRC

*** ~Node~ 类型的值的构造

我们通过调用 ~moonbit_make_external_object~ 来构造合法的
~MoonBitTSNode~ 对象，并初始化该对象来持有对应语法树的所有权。

#+BEGIN_SRC c
static inline void
moonbit_ts_node_delete(void *object);

MoonBitTSNode *
moonbit_ts_tree_root_node(MoonBitTSTree *tree) {
  TSNode node = ts_tree_root_node(tree->tree);
  MoonBitTSNode *self = moonbit_make_external_object(
    moonbit_ts_node_delete,
    sizeof(MoonBitTSNode)
  );
  self->node = node;
  self->tree = tree;
  return self;
}
#+END_SRC

*** ~Node~ 类型的值的析构

同时，我们需要在 ~MoonBitTSNode~ 被释放的时候，维护存储的
~MoonBitTSTree~ 的指针，防止内存泄漏。

#+BEGIN_SRC c
static inline void
moonbit_ts_node_delete(void *object) {
  MoonBitTSNode *self = (MoonBitTSNode *)object;
  moonbit_decref(self->tree);
}
#+END_SRC

在完成这些工作以后，我们可以在 MoonBit 侧绑定这些函数了。

#+BEGIN_SRC moonbit
extern "c" fn Tree::root_node(self : Tree) -> Node =
  "moonbit_ts_tree_root_node"
extern "c" fn Node::language(self : Node) -> Language =
  "moonbit_ts_node_language"
#+END_SRC

* 使用 MoonBit 的 Tree-sitter 绑定

MoonBit 的 Tree-sitter 绑定提供了一套和 C API 比较接近的接口。下面是一
个简单的 parse MoonBit 源码的代码：

#+BEGIN_SRC moonbit
fn main {
  let moonbit = @tree_sitter_moonbit.language()
  let parser = @tree_sitter.Parser::new()
  parser.set_language(moonbit)
  let source =
    #|fn main {
    #|  if 1 == 1 {
    #|    println("Hello, world!")
    #|  }
    #|}
  let tree = parser.parse_string(None, source)
  let root_node = tree.root_node()
  println(root_node.string())
}
#+END_SRC

如果一切顺利，那么你会在终端里面看到一坨挤在一起的 S 表达式：

#+BEGIN_SRC
(structure (structure_item (function_definition (function_identifier (lowercase_identifier)) (block_expression (statement_expression (expression (if_expression (compound_expression (binary_expression (compound_expression (simple_expression (atomic_expression (literal (integer_literal))))) (compound_expression (simple_expression (atomic_expression (literal (integer_literal))))))) (block_expression (statement_expression (expression (pipeline_expression (compound_expression (simple_expression (apply_expression (simple_expression (qualified_identifier (lowercase_identifier))) (argument (expression (pipeline_expression (compound_expression (simple_expression (atomic_expression (literal (string_literal (string_fragment (unescaped_string_fragment)))))))))))))))) (semicolon (automatic_semicolon)))))) (semicolon (automatic_semicolon))))))
#+END_SRC

** ~tonyfettes/tree_sitter/sexp~

我们提供了一个简单的 S 表达式的 parser 和 printer ，用来将输出打印成更
人类可读的形式。

#+BEGIN_SRC json
{
  "import": [
    "tonyfettes/tree_sitter/sexp"
  ]
}
#+END_SRC

#+BEGIN_SRC moonbit
fn main {
  ...
  let root_sexp = @sexp.parse!(root_node.string())
  let root_text = StringBuilder::new()
  @sexp.print(root_sexp, root_text)
  println(root_text.to_string())
  ...
}
#+END_SRC

#+NAME: 终端输出
#+BEGIN_SRC query
(structure
 (structure_item
  (function_definition
   (function_identifier
    (lowercase_identifier))
    ; ...
    (semicolon
     (automatic_semicolon)))))
#+END_SRC

** 代码检查（Lint）

