docs/presentation/src/index.html
<div id="outline-container-orgdeaf91b" class="outline-3">
<h3 id="orgdeaf91b"><span class="section-number-3">3.2.</span> 返回值</h3>
<div class="outline-text-3" id="text-3-2">
<p>
然而，并不是所有的 API 都会将所有权交给调用者。如果函数返回的是通过
<code>const</code> 修饰的指针，则意味着调用者拥有被返回对象的临时借用，不拥有对象的所有权，因此不需要处理资源释放。
</p>

<p>
例如，Tree-sitter 提供的从 <code>TSNode</code> 获取对应的 <code>TSLanguage</code> ，就是对
<code>TSLanguage</code> 的临时借用。调用者不需要释放 <code>TSLanguage</code> 。
</p>

<div class="org-src-container">
<pre class="src src-c">const TSLanguage *ts_node_language(TSNode self);
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d5ddb7" class="outline-3">
<h3 id="org5d5ddb7"><span class="section-number-3">3.3.</span> 聚合数据类型</h3>
<div class="outline-text-3" id="text-3-3">
<p>
类似的，在聚合数据类型中，带有 <code>const</code> 修饰的指针说明这是一个借用，而没有被修饰的指针代表对该对象的所有权。
</p>

<div class="org-src-container">
<pre class="src src-c">typedef struct TSNode {
  uint32_t context[4];
  const void *id; // 借用
  const TSTree *tree; // 借用
} TSNode;

typedef struct TSQueryCursorState {
  void *payload; // 拥有所有权，需要负责释放
  uint32_t current_byte_offset;
} TSQueryCursorState;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb998e37" class="outline-2">
<h2 id="orgb998e37"><span class="section-number-2">4.</span> 在 MoonBit 中绑定 Tree-sitter</h2>
<div class="outline-text-2" id="text-4">
<p>
我们可以从上面的讨论发现，MoonBit 的内存管理和 Tree-sitter 有很大的不同：
</p>

<ol class="org-ol">
<li>MoonBit 有引用计数，Tree-sitter 没有。</li>
<li>MoonBit 的借用是共享所有权，而 tree-sitter 的借用没有所有权。</li>
<li>MoonBit 采用的是 callee owned 的所有权传递，而 Tree-sitter 采用的是
caller owned 的所有权传递。</li>
</ol>

<p>
因此，在 MoonBit 中绑定 Tree-sitter ，需要对裸的 Tree-sitter 的 C API
进行包装，从而满足 MoonBit 引用计数系统要求。
</p>

<p>
为了方便在 MoonBit 中实现 C 的 FFI 绑定，MoonBit 提供了两种对外部数据类型的抽象：外部类型（external type）和抽象类型（abstract type）。
</p>
</div>
<div id="outline-container-org42ebc7d" class="outline-3">
<h3 id="org42ebc7d"><span class="section-number-3">4.1.</span> 外部类型</h3>
<div class="outline-text-3" id="text-4-1">
<p>
外部类型可以通过如下方式定义：
</p>

<div class="org-src-container">
<pre class="src src-moonbit">extern type A
</pre>
</div>

<p>
外部类型不参与内存管理，任何 <code>A</code> 类型的对象将不参与引用计数系统。这通常用来绑定：
</p>

<ol class="org-ol">
<li>具有静态生命周期的对象；</li>
<li>不由 MoonBit 分配的对象；</li>
<li>需要手动管理的对象。</li>
</ol>

<p>
外部类型在 C 代码中表示为指针（ <code>void *</code> ），在 MoonBit 侧可以放在接受或者返回指针的地方。
</p>
</div>
<div id="outline-container-org29dad3b" class="outline-4">
<h4 id="org29dad3b"><span class="section-number-4">4.1.1.</span> <code>@tree_sitter.Language</code></h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Tree-sitter 中，我们从各个语言拿到的 <code>TSLanguage</code> 对象都是静态分配的，因此，我们可以将其绑定为外部类型，从而避免传递该对象时对其进行
<code>incref</code> / <code>decref</code> 操作。
</p>

<div class="org-src-container">
<pre class="src src-c" id="orge4987e4">const TSLanguage *tree_sitter_json(void);
</pre>
</div>

<div class="org-src-container">
<pre class="src src-moonbit" id="orgc16c665">extern type Language
extern "c" fn tree_sitter_json() -&gt; Language =
  "tree_sitter_json"
</pre>
</div>

<p>
需要注意的是，虽然 Tree-sitter 提供了 <code>ts_language_delete</code> 函数，但是该函数只对通过 Wasm module 加载的语言有效，所以更适用外部类型来进行绑定。
</p>
</div>
</div>
</div>
<div id="outline-container-orga9a53a8" class="outline-3">
<h3 id="orga9a53a8"><span class="section-number-3">4.2.</span> 抽象类型</h3>
<div class="outline-text-3" id="text-4-2">
<p>
抽象类型可以通过如下的方式进行定义：
</p>

<div class="org-src-container">
<pre class="src src-moonbit">type Node
</pre>
</div>

<p>
抽象类型参与内存管理，并且能够在生命周期结束的时候调用对应的析构函数，进行自动化的资源释放，基本上可以用来绑定任何需要资源管理的对象。抽象类型在 C 侧表示为指针（ <code>void *</code> ）。然而，并不是所有指针都能够被作为该类型的值使用。由于 MoonBit 在进行 <code>incref</code> / <code>decref</code> 的时候会读取对象头，所以只有通过 <code>moonbit_make_external_object</code> 分配的对象可以作为抽象类型的值使用。以下是 <code>moonbit_make_external_object</code> 函数的签名。
</p>

<div class="org-src-container">
<pre class="src src-c">void *moonbit_make_external_object(
  void (*finalize)(void *self),
  uint32_t payload_size
);
</pre>
</div>
</div>
<div id="outline-container-org98405f0" class="outline-4">
<h4 id="org98405f0"><span class="section-number-4">4.2.1.</span> <code>Node</code> 的类型定义</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
在 Tree-sitter 中， <code>TSNode</code> 表示语法树上的一个节点。
</p>

<div class="org-src-container">
<pre class="src src-c">typedef struct TSNode {
  uint32_t context[4];
  const void *id;
  const TSTree *tree;
} TSNode;
</pre>
</div>

<p>
注意到， <code>TSNode</code> 拥有对于该节点所在语法树（ <code>TSTree</code> ）的借用。在
Tree-sitter 中，借用不拥有所有权，所以我们需要确保对应的语法树的生命周期长于该节点。因此，我们在 <code>MoonBitTSNode</code> 中额外添加了
<code>MoonBitTSTree</code> 的一份指针，以确保 <code>MoonBitTSNode</code> 在生命周期内总是持有 <code>MoonBitTSTree</code> 的一份引用，防止 <code>TSNode</code> 中对应的指针因为 <code>TSTree</code>
被释放而失效。
</p>

<div class="org-src-container">
<pre class="src src-c">typedef struct MoonBitTSNode {
  TSNode node;
  MoonBitTSNode *tree;
} MoonBitTSNode;
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e12123" class="outline-4">
<h4 id="org4e12123"><span class="section-number-4">4.2.2.</span> <code>Node</code> 类型的值的构造</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
我们通过调用 <code>moonbit_make_external_object</code> 来构造合法的
<code>MoonBitTSNode</code> 对象，并初始化该对象来持有对应语法树的所有权。
</p>

<div class="org-src-container">
<pre class="src src-c">static inline void
moonbit_ts_node_delete(void *object);

MoonBitTSNode *
moonbit_ts_tree_root_node(MoonBitTSTree *tree) {
  TSNode node = ts_tree_root_node(tree-&gt;tree);
  MoonBitTSNode *self = moonbit_make_external_object(
    moonbit_ts_node_delete,
    sizeof(MoonBitTSNode)
  );
  self-&gt;node = node;
  self-&gt;tree = tree;
  return self;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga7d46d1" class="outline-4">
<h4 id="orga7d46d1"><span class="section-number-4">4.2.3.</span> <code>Node</code> 类型的值的析构</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
同时，我们需要在 <code>MoonBitTSNode</code> 被释放的时候，维护存储的
<code>MoonBitTSTree</code> 的指针，防止内存泄漏。
</p>

<div class="org-src-container">
<pre class="src src-c">static inline void
moonbit_ts_node_delete(void *object) {
  MoonBitTSNode *self = (MoonBitTSNode *)object;
  moonbit_decref(self-&gt;tree);
}
</pre>
</div>

<p>
在完成这些工作以后，我们可以在 MoonBit 侧绑定这些函数了。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">extern "c" fn Tree::root_node(self : Tree) -&gt; Node =
  "moonbit_ts_tree_root_node"
extern "c" fn Node::language(self : Node) -&gt; Language =
  "moonbit_ts_node_language"
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org3f2b453" class="outline-2">
<h2 id="org3f2b453"><span class="section-number-2">5.</span> 使用 MoonBit 的 Tree-sitter 绑定</h2>
<div class="outline-text-2" id="text-5">
<p>
MoonBit 的 Tree-sitter 绑定提供了一套和 C API 比较接近的接口。下面是一个简单的 parse MoonBit 源码的代码：
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  let moonbit = @tree_sitter_moonbit.language()
  let parser = @tree_sitter.Parser::new()
  parser.set_language(moonbit)
  let source =
    #|fn main {
    #|  if 1 == 1 {
    #|    println("Hello, world!")
    #|  }
    #|}
  let tree = parser.parse_string(None, source)
  let root_node = tree.root_node()
  println(root_node.string())
}
</pre>
</div>

<p>
如果一切顺利，那么你会在终端里面看到一坨挤在一起的 S 表达式：
</p>

<div class="org-src-container">
<pre class="src src-nil">(structure (structure_item (function_definition (function_identifier (lowercase_identifier)) (block_expression (statement_expression (expression (if_expression (compound_expression (binary_expression (compound_expression (simple_expression (atomic_expression (literal (integer_literal))))) (compound_expression (simple_expression (atomic_expression (literal (integer_literal))))))) (block_expression (statement_expression (expression (pipeline_expression (compound_expression (simple_expression (apply_expression (simple_expression (qualified_identifier (lowercase_identifier))) (argument (expression (pipeline_expression (compound_expression (simple_expression (atomic_expression (literal (string_literal (string_fragment (unescaped_string_fragment)))))))))))))))) (semicolon (automatic_semicolon)))))) (semicolon (automatic_semicolon))))))
</pre>
</div>
</div>
<div id="outline-container-org8231665" class="outline-3">
<h3 id="org8231665"><span class="section-number-3">5.1.</span> <code>tonyfettes/tree_sitter/sexp</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
我们提供了一个简单的 S 表达式的 parser 和 printer ，用来将输出打印成更人类可读的形式。
</p>

<div class="org-src-container">
<pre class="src src-json">{
  "import": [
    "tonyfettes/tree_sitter/sexp"
  ]
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  ...
  let root_sexp = @sexp.parse!(root_node.string())
  let root_text = StringBuilder::new()
  @sexp.print(root_sexp, root_text)
  println(root_text.to_string())
  ...
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-query" id="org34c61dd">(structure
 (structure_item
  (function_definition
   (function_identifier
    (lowercase_identifier))
    ; ...
    (semicolon
     (automatic_semicolon)))))
</pre>
</div>
</div>
</div>
