docs/presentation/src/index.org
*** 使用 ~Node~ API 遍历语法树

通过 ~tree.root_node()~ 拿到语法树的根节点以后，我们就可以通过 ~Node~
相关的 API ，递归地检查语法树中的节点，来寻找可能出现的错误。

#+BEGIN_SRC moonbit
fn main {
  ...
  fn find_x_eq_x(node : @tree_sitter.Node) -> Unit {
    if node.type_() == "binary_expression" {
      let left = node.child(0).unwrap()
      let right = node.child(2).unwrap()
      let left_content = source[left.start_byte():left.end_byte()]
      let right_content = source[right.start_byte():right.end_byte()]
      if [..left_content] == [..right_content] {
        println("Found x == x at line \{node.start_point().row() + 1}")
      }
    }
    for child in node.children() {
      find_x_eq_x(child)
    }
  }
  find_x_eq_x(root_node)
}
#+END_SRC

#+BEGIN_SRC
Found x == x at line 2
#+END_SRC

*** 使用 Query

虽然这种方式非常灵活，但是写起来还是有些麻烦。Tree-sitter 为我们提供了
query 功能，允许我们通过书写 query ，来寻找符合 query 中模式的节点。

#+BEGIN_SRC moonbit
fn main {
  ...
  let query =
    #|(binary_expression (_) @left "==" (_) @right)
  let query_cursor = @tree_sitter.QueryCursor::new()
  query_cursor.exec(@tree_sitter.Query::new!(moonbit, query), root_node)
  while query_cursor.next_match() is Some(match_) {
    let left = match_.captures[0].node
    let right = match_.captures[1].node
    let left_content = source[left.start_byte():left.end_byte()]
    let right_content = source[right.start_byte():right.end_byte()]
    if [..left_content] == [..right_content] {
      println("Found x == x at Line \{left.start_point().row() + 1}")
    }
  }
}
#+END_SRC

这种方式效率高，可以允许使用用户定义的 query ，也是目前 moon-lint 采取
的方案。但是这种方案的缺点也很明显：功能受到 query 表达能力的限制。比
如，寻找一个不含有 ~continue~ 语句的 ~for~ 循环就没有办法只通过一次
query 来完成。

在未来，我们会探索更多的书写 lint 规则的方式：

1. 设计一个类似于 Datalog 或者 SQL 的查询语言。
2. 通过 WASM runtime 来运行用户的 lint 程序，从而实现更高的灵活性。

** 代码重构（Refactor）

除了检查一些简单的逻辑错误以外，我们还能够在 Tree-sitter 的基础上实现
错误的自动修复，和进行代码的现代化重构（modernization）。

从 Tree-sitter 的 query 出发，我们可以在 Tree-sitter 上实现类似于正则
的查找替换功能。在 Tree-sitter 的 query 中，你可以通过 ~@<name>~ 的方
式捕获一个节点。在 moon-lint 的替换表达式中，你可以通过 ~$<name>~ 的语
法让这些捕获的节点填入到替换字符串中。例如，我们希望将形如 ~not(a <
b)~ 的代码替换成 ~a >= b~ ，那么我们可以用如下的 query 和替换表达式来
完成这项工作。

#+BEGIN_SRC query
(apply_expression
 (simple_expression) @functionName
 (argument
  (expression
   (pipeline_expression
    (compound_expression
     (binary_expression
      (_) @left
      "<"
      (_) @right)))))
 (#eq? @functionName "not"))
#+END_SRC

#+BEGIN_SRC
$left >= $right
#+END_SRC
