docs/presentation/src/index.html
<div id="outline-container-orga332b08" class="outline-3">
<h3 id="orga332b08"><span class="section-number-3">5.2.</span> 代码检查（Lint）</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org2d5db67" class="outline-4">
<h4 id="org2d5db67"><span class="section-number-4">5.2.1.</span> 使用 <code>Node</code> API 遍历语法树</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
通过 <code>tree.root_node()</code> 拿到语法树的根节点以后，我们就可以通过 <code>Node</code>
相关的 API ，递归地检查语法树中的节点，来寻找可能出现的错误。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  ...
  fn find_x_eq_x(node : @tree_sitter.Node) -&gt; Unit {
    if node.type_() == "binary_expression" {
      let left = node.child(0).unwrap()
      let right = node.child(2).unwrap()
      let left_content = source[left.start_byte():left.end_byte()]
      let right_content = source[right.start_byte():right.end_byte()]
      if [..left_content] == [..right_content] {
        println("Found x == x at line \{node.start_point().row() + 1}")
      }
    }
    for child in node.children() {
      find_x_eq_x(child)
    }
  }
  find_x_eq_x(root_node)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">Found x == x at line 2
</pre>
</div>
</div>
</div>
<div id="outline-container-org16f5360" class="outline-4">
<h4 id="org16f5360"><span class="section-number-4">5.2.2.</span> 使用 Query</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
虽然这种方式非常灵活，但是写起来还是有些麻烦。Tree-sitter 为我们提供了
query 功能，允许我们通过书写 query ，来寻找符合 query 中模式的节点。
</p>

<div class="org-src-container">
<pre class="src src-moonbit">fn main {
  ...
  let query =
    #|(binary_expression (_) @left "==" (_) @right)
  let query_cursor = @tree_sitter.QueryCursor::new()
  query_cursor.exec(@tree_sitter.Query::new!(moonbit, query), root_node)
  while query_cursor.next_match() is Some(match_) {
    let left = match_.captures[0].node
    let right = match_.captures[1].node
    let left_content = source[left.start_byte():left.end_byte()]
    let right_content = source[right.start_byte():right.end_byte()]
    if [..left_content] == [..right_content] {
      println("Found x == x at Line \{left.start_point().row() + 1}")
    }
  }
}
</pre>
</div>

<p>
这种方式效率高，可以允许使用用户定义的 query ，也是目前 moon-lint 采取的方案。但是这种方案的缺点也很明显：功能受到 query 表达能力的限制。比如，寻找一个不含有 <code>continue</code> 语句的 <code>for</code> 循环就没有办法只通过一次
query 来完成。
</p>

<p>
在未来，我们会探索更多的书写 lint 规则的方式：
</p>

<ol class="org-ol">
<li>设计一个类似于 Datalog 或者 SQL 的查询语言。</li>
<li>通过 WASM runtime 来运行用户的 lint 程序，从而实现更高的灵活性。</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga269307" class="outline-3">
<h3 id="orga269307"><span class="section-number-3">5.3.</span> 代码重构（Refactor）</h3>
<div class="outline-text-3" id="text-5-3">
<p>
除了检查一些简单的逻辑错误以外，我们还能够在 Tree-sitter 的基础上实现错误的自动修复，和进行代码的现代化重构（modernization）。
</p>

<p>
从 Tree-sitter 的 query 出发，我们可以在 Tree-sitter 上实现类似于正则的查找替换功能。在 Tree-sitter 的 query 中，你可以通过 <code>@&lt;name&gt;</code> 的方式捕获一个节点。在 moon-lint 的替换表达式中，你可以通过 <code>$&lt;name&gt;</code> 的语法让这些捕获的节点填入到替换字符串中。例如，我们希望将形如 <code>not(a &lt;
b)</code> 的代码替换成 <code>a &gt;= b</code> ，那么我们可以用如下的 query 和替换表达式来完成这项工作。
</p>

<div class="org-src-container">
<pre class="src src-query">(apply_expression
 (simple_expression) @functionName
 (argument
  (expression
   (pipeline_expression
    (compound_expression
     (binary_expression
      (_) @left
      "&lt;"
      (_) @right)))))
 (#eq? @functionName "not"))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">$left &gt;= $right
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
